In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
                              'FlightNumber':[10045,np.nan,10065,np.nan,10085],
                              'RecentDelays':[[23,47],[],[24,43, 87], [13], [67, 32]],
                              'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
## Creating a checkpoint
df_copy = df
df_copy

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## Solution to first problem statement

In [5]:
v = df['FlightNumber'].values
v

array([10045.,    nan, 10065.,    nan, 10085.])

In [6]:
flight_num_val = []

for i in range(len(v)):
    if np.isnan(v[i])== True:
        flight_num_val.append(int(v[i-1]+10))
    else:
        flight_num_val.append(int(v[i]))
       
flight_num_val

[10045, 10055, 10065, 10075, 10085]

In [7]:
df['FlightNumber'] = flight_num_val
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## Solution to second problem statement

In [8]:
Fr_To = df['From_To'].values
Fr_To

array(['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
       'Budapest_PaRis', 'Brussels_londOn'], dtype=object)

In [9]:
## Splitting the strings on the delimiter _

splitted_list = []
for i in range(len(Fr_To)):
    splitted_list.extend(Fr_To[i].split("_"))
    
splitted_list

['LoNDon',
 'paris',
 'MAdrid',
 'miLAN',
 'londON',
 'StockhOlm',
 'Budapest',
 'PaRis',
 'Brussels',
 'londOn']

In [10]:
## Segregating the splitted_list into two lists : "Departing_From_" and "Destined_To_"

Departing_From_, Destined_To_=[],[]

for i in range(len(splitted_list)):
    if i%2==0:
        Departing_From_.append(splitted_list[i])
    else:
        Destined_To_.append(splitted_list[i])
        
print("Departing_From = ", Departing_From_)
print("Destined_To = ", Destined_To_)

Departing_From =  ['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']
Destined_To =  ['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

## Creating temporary dataframe

In [11]:
temp_dataframe = pd.DataFrame({'Departing_From':Departing_From_, 'Destined_To':Destined_To_ })
temp_dataframe

  Departing_From Destined_To
0         LoNDon       paris
1         MAdrid       miLAN
2         londON   StockhOlm
3       Budapest       PaRis
4       Brussels      londOn

## Solution to third problem statement

In [12]:
temp_dataframe['Departing_From']= temp_dataframe['Departing_From'].apply(str.capitalize)
temp_dataframe['Destined_To']= temp_dataframe['Destined_To'].apply(str.capitalize)

In [13]:
temp_dataframe

  Departing_From Destined_To
0         London       Paris
1         Madrid       Milan
2         London   Stockholm
3       Budapest       Paris
4       Brussels      London

## Solution to fourth problem statement

In [14]:
df['Departing_From'], df['Destined_To'] =  temp_dataframe['Departing_From'], temp_dataframe['Destined_To']
df = df.drop("From_To", axis=1)

In [15]:
df

   FlightNumber  RecentDelays              Airline Departing_From Destined_To
0         10045      [23, 47]               KLM(!)         London       Paris
1         10055            []    <Air France> (12)         Madrid       Milan
2         10065  [24, 43, 87]  (British Airways. )         London   Stockholm
3         10075          [13]       12. Air France       Budapest       Paris
4         10085      [67, 32]          "Swiss Air"       Brussels      London

## Solution to fifth problem statement

In [16]:
delay_value = df['RecentDelays']
delay_value

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [17]:
## temp_var : temporary variable

temp_var = delay_value.values   
temp_var

array([list([23, 47]), list([]), list([24, 43, 87]), list([13]),
       list([67, 32])], dtype=object)

In [18]:
temp_var1,temp_var2,temp_var3=[],[],[]

for i in range(len(temp_var)):
    try:
        temp_var1.append(temp_var[i][0])
    except:
        temp_var1.append(np.nan)   ## appending np.nan , if the Nth Value is non existing
        
    try:
        temp_var2.append(temp_var[i][1])
    except:
        temp_var2.append(np.nan)   ## appending np.nan , if the Nth Value is non existing
        
    try:
        temp_var3.append(temp_var[i][2])
    except:
        temp_var3.append(np.nan)   ## appending np.nan , if the Nth Value is non existing
        
print("temp_var1 = ", temp_var1)
print("temp_var2 = ", temp_var2)
print("temp_var3 = ", temp_var3)

temp_var1 =  [23, nan, 24, 13, 67]
temp_var2 =  [47, nan, 43, nan, 32]
temp_var3 =  [nan, nan, 87, nan, nan]

In [19]:
delays = pd.DataFrame({'delay_1': temp_var1, 'delay_2': temp_var2, 'delay_3': temp_var3  })
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [20]:
df['delay_1'], df['delay_2'], df['delay_3'] = delays['delay_1'], delays['delay_2'], delays['delay_3']

In [21]:
df = df.drop("RecentDelays", axis=1)
df

,FlightNumber,Airline,Departing_From,Destined_To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

#### Re-aligning the columns

In [22]:
df.columns

Index(['FlightNumber', 'Airline', 'Departing_From', 'Destined_To', 'delay_1',
       'delay_2', 'delay_3'],
      dtype='object')

In [23]:
df = df[['FlightNumber', 'Departing_From', 'Destined_To', 'delay_1','delay_2', 'delay_3', 'Airline']]

## FINAL ANSWER

In [24]:
df

,FlightNumber,Departing_From,Destined_To,delay_1,delay_2,delay_3,Airline
0,10045,London,Paris,23.0,47.0,NaN,KLM(!)
1,10055,Madrid,Milan,NaN,NaN,NaN,<Air France> (12)
2,10065,London,Stockholm,24.0,43.0,87.0,(British Airways. )
3,10075,Budapest,Paris,13.0,NaN,NaN,12. Air France
4,10085,Brussels,London,67.0,32.0,NaN,"""Swiss Air"""